In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
#creating path to data folder
path = r'/Users/farhodfurkatov/Desktop/CF Data Immersion Achievment 4/Instacart Basket Analysis/02 Data'

In [21]:
# creating df_prods
df_prods = pd.read_csv(os.path.join(path, 'Original Data/products.csv'), index_col = False)

In [22]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [84]:
# creating df_ords
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data/orders_wrangled.csv'), index_col = False)

In [85]:
df_ords.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [86]:
# create a dataframe
df_test = pd.DataFrame()

In [87]:
# creat a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [88]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [89]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [90]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [91]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [92]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [93]:
df_prods.shape

(49693, 5)

In [94]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [95]:
df_prods_clean.shape

(49677, 5)

In [96]:
# another way to drop the columns
# df_prods[‘product_name’].dropna(inplace = True)

In [97]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [98]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [99]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [100]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

## Step 2

In [101]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [102]:
# First thing to notice is, that max price of a product 99999, this needs to be looked further
# Count of row 49693, however maximum product_id number is 49688 so I would also want to look if there dublicate in 
# some rows

## Step 3 and 4

In [103]:
# check for mixed type data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [104]:
# didnt find any column with mixed data

In [105]:
# we can also check data types 
df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
order_day_of_week           int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

## Step 5

In [106]:
# check for any missing values
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

## Step 6

In [107]:
# We have 206209 row with missing values in days_since_prior_order
# reson for that is when customer orders for the first time we will have a no value in that row
# We can also say it is wehen new customer registers and orders for the first time in the instacard platform

## Step 7

In [109]:
#looking for duplicates in df, create dups datafram
df_ords_dup = df_ords[df_ords.duplicated()]

In [110]:
df_ords_dup

Empty DataFrame
Columns: [order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [112]:
# no duplicate rows

## Step 8

In [ ]:
# I would create seperate dataframe to drop the duplicates with drop_duplicates function

## Step 9

In [123]:
df_ords.to_csv(os.path.join(path, 'Prepared Data/orders_clean.csv'), index = False)

In [124]:
df_prods.to_csv(os.path.join(path, 'Prepared Data/products_clean.csv'), index = False)

In [125]:
df_ords.shape

(3421083, 6)

In [126]:
df_ords.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0